{
  "basics": {
    "name": "Vishal Kumar. S",
    "label": "Artificial Intelligence and Data Science Student",
    "image": "/assets/img/prof_pic.jpg",
    "email": "vk28.02.2004@gmail.com",
    "phone": "+91 6383358799",
    "url": "linkedin.com/in/vishal-kumar-s-095491247/",
    "summary": "Dedicated student pursuing a Bachelor's degree in Artificial Intelligence and Data Science. Passionate about data analysis, machine learning, and software development. Strong problem-solving skills and a quick learner. Seeking opportunities to apply and expand my knowledge in real-world projects.",
    "location": {
      "address": "Tamil Nadu, India"
    },
    "profiles": [
      {
        "network": "GitHub",
        "url": "https://github.com/VishalKumar-S"
      }
    ]
  },
  "work": [],
  "volunteer": [],
  "education": [
    {
      "institution": "Sri Eshwar College Of Engineering, Coimbatore",
      "area": "Artificial Intelligence and Data Science",
      "studyType": "Bachelor's (B. Tech.)",
      "startDate": "2022",
      "endDate": "2026",
      "score": "CGPA: 8.28/10 (till 2nd Semester)"
    }
  ],
  "projects": [
    {
      "name": "Flight Delay Prediction and Live Monitoring",
      "description": "Developed a Streamlit web application to predict flight delays, for airline operations. Implemented MVC architecture in the Streamlit web app code. Utilized Azure to fetch the raw dataset. Trained the data with an XGBoost Regressor model, after evaluating various regression models. Containerized the application using Docker. Integrated Evidently for live Data and Model performance reports. It helps in finding the delays, generating reports of the new batch data, and the performance of our model with the new data, in the production environment. Deployed the live web application in Streamlit sharing.",
      "url": "https://github.com/VishalKumar-S/Flight-Delay-Prediction-and-live-Monitoring-with-Azure-Evidently-and-Streamlit-with-MVC-Architecture"
    },
    {
      "name": "Employee Attrition Rate Prediction - MLOps Project",
      "description": "Developed a Streamlit web application to predict the attrition rate of employees. Used Logistic Regression model to train the data. Implemented ZenML, an MLOps orchestration tool, for creating ML pipelines, and to integrate with other MLOps tools. Integrated mlflow, an experiment-tracking tool, with ZenML, to track our pipelines. Implemented CI/CD for continuous data integration and deployed the best-performing model.",
      "url": "https://github.com/VishalKumar-S/Employee-attrition-rate-MLOps-Project"
    }
  ],
  "certifications": [
    {
      "title": "Certificate of Appreciation for “Analyse Growth and Present Insights to the Telangana Government” Resume Project Challenge.",
      "date": "https://codebasics.io/certificate/CB-CH-1-10-41936"
    }
  ],
  "skills": [{
    "Languages":"C | Java | Python",
    // "Web Technologies - HTML | CSS - Basic",
    // "Core Concepts - DSA, OOPs",
    // "Experiment tracking tools - mlflow",
    // "Data Validator tools - Evidently",
    // "Artifact store - S3 bucket, Azure blob storage",
    // "Orchestrator - ZenML, GitHub Actions",
    // "Cloud - AWS, Azure",
    // "Data Science Libraries - NumPy, Pandas, Scikit-learn, SciPy, Matplotlib, Seaborn"
}],
  "achievements": [
    "Successfully merged 2 PRs in Hacktoberfest 2023, receiving exclusive digital badges and a tree plantation as a reward.",
    "Won the third prize with the reward of Rs. 9,500 for my Blog, “Employee Attrition Rate Prediction using ZenML and Streamlit,” in the Best Guides Category in Blogathon 36 in Analytics Vidhya.",
    "Published 2 blogs related to MLOps in Analytics Vidhya."
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Tamil",
      "fluency": "Native Speaker"
    }
  ],
  "interests": [
    "Technology",
    "Finance",
    "Blogging"
  ],
  "references": []
}
